01_V&V/inletL/reactingPimple_lit/constant/chemistryProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    chemistrySolver   noChemistrySolver;
    chemistryThermo   psi;
}

chemistry           off;

initialChemicalTimeStep 1e-06;

EulerImplicitCoeffs
{
    cTauChem        1;
    equilibriumRateLimiter off;
}

odeCoeffs
{
    solver          Rosenbrock43;
    absTol          1e-12;
    relTol          0.01;
}

// ************************************************************************* //