01_V&V/inletL/reactingPimple_lit/constant/reactions
/*--------------------------------*- C++ -*----------------------------------*\
|   Dummy reactions file: 1 inert species, 0 reactions                       |
\*---------------------------------------------------------------------------*/

species
(
    air
);

reactions
{
    // No reactions – non-reacting case
}
