01_V&V/inletL/reactingPimple_lit/constant/thermo.compressibleGas
/*--------------------------------*- C++ -*----------------------------------*\
|   Thermo data for a single ideal-gas species: air                          |
\*---------------------------------------------------------------------------*/

air
{

specie
{
	molWeight	28.96;
}

thermodynamics
{
	Cp	1004;
	Hf	0;
}

transport
{
	mu	0;
	Pr	0.71;
}


}
