01_V&V/inletL/reactingPimple_lit/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

// Mach 5, T = 62.5 K  → |U| ≈ 792.35 m/s along +x
internalField   uniform (792.35 0 0);

boundaryField
{
    P.Inlet
    {
        type        fixedValue;
        value       uniform (792.35 0 0);
    }

    P.Outlet
    {
        type            inletOutlet;
        inletValue      uniform (792.35 0 0);
        value           uniform (792.35 0 0);
    }

    Farfield
    {
        type        zeroGradient;
    }

    Wall
    {
        // Inviscid assumption → slip wall
        type        slip;
    }

    Symmetry
    {
        type        symmetryPlane;
    }

    patch0
    {
        type        empty;
    }

    patch3
    {
        type        empty;
    }
}