01_V&V/inletL/reactingPimple_lit/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           |                                                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}

dimensions      [0 0 0 1 0 0 0];   // K

internalField   uniform 62.5;

boundaryField
{
    P.Inlet
    {
        type        fixedValue;
        value       uniform 62.5;
    }

    P.Outlet
    {
        type            inletOutlet;
        inletValue      uniform 62.5;
        value           uniform 62.5;
    }

    Farfield
    {
        type        zeroGradient;
    }

    Wall
    {
        // Inviscid, adiabatic wall
        type        zeroGradient;
    }

    Symmetry
    {
        type        symmetryPlane;
    }

    patch0
    {
        type        empty;
    }

    patch3
    {
        type        empty;
    }
}
