01_V&V/inletL/reactingPimple_lit/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

defaultAdvScheme     upwind;
defaultAdvSchemeV    upwind;

divSchemes
{
    default         none;

    // momentum equation
    div(phi_nei,U)                              Gauss $defaultAdvSchemeV;
    div(phi_own,U)                              Gauss $defaultAdvSchemeV;
    div(((rho*nuEff)*dev2(T(grad(U)))))         Gauss linear;

    // energy equation (enthalpy)
    div(phi_nei,h)                              Gauss $defaultAdvScheme;
    div(phi_own,h)                              Gauss $defaultAdvScheme;
    div(phi_nei,K)                              Gauss $defaultAdvScheme;
    div(phi_own,K)                              Gauss $defaultAdvScheme;
    div(alphaEff*hi,grad(Yi))                   Gauss linear;
    div(rhoi*Uri,hi)                            Gauss linear;

    // continuity equation
    div(phid_nei,p)                             Gauss $defaultAdvScheme;
    div(phid_own,p)                             Gauss $defaultAdvScheme;
    
    // mixture component transport equation
    div(phi_nei,Yi)                             Gauss $defaultAdvScheme;
    div(phi_own,Yi)                             Gauss $defaultAdvScheme;
}

laplacianSchemes
{
    default         Gauss linear corrected;
}

interpolationSchemes
{
    default         none;
    
    interpolate((rho*U))                        linear;
    interpolate(((rho*nut)+thermo:mu))         linear;
    
    reconstruct(rho)                            $defaultAdvScheme;
    reconstruct(psi)                            $defaultAdvScheme;
    reconstruct(p)                              $defaultAdvScheme;
    reconstruct(U)                              $defaultAdvSchemeV;
    reconstruct(rho*U)                          $defaultAdvSchemeV;
    reconstruct(Dp)                             $defaultAdvScheme;
}

snGradSchemes
{
    default         corrected;
}

fluxRequired
{
    default     none;
    p;
    h;
    Yi;

}

relaxationFactors
{
    equations
    {
        p       0.3;
        U       0.5;
        h       0.5;
        T       0.5;
        rho     0.5;
    }
}

// ************************************************************************* //
